{
    "products": [
      {
        "id": "1",
        "title": "Digitalkamera FHD 1080p",
        "price": 720.95,
        "description": "  Lieferumfang: Digital Camera EOS 2000D Body black; 18-55mm 3, 5-5, 6 III; Eyecup EF; Camera Cover R-F-3; Neck Strap EW-400D; Battery Charger LC-E10E, Battery Pack LP-E10, BatteryTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideaTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (ATragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfl für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarf Pack. ",
        "category": "men's clothing",
        "image": "https://tse2.mm.bing.net/th?id=OIP.Hh7gdJfrLuP9gWXTsFE00gHaFO&pid=Api&P=0&h=180",
        "rating": {
          "rate": 3.9,
          "count": 120
        }
      },
      {
        "id": "2",
        "title": "Digitalkamera 4K, 48MP 16X Autofokus ",
        "price": 450.3,
        "description": "ger LC-E10E, Battery Pack LP-E10, Battery Pack light weight Tragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, VerwacTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarf And Solid stitched .",
        "category": "men's clothing",
        "image": "https://tse4.mm.bing.net/th?id=OIP.P91Fso2Ql_-Ea2YwZlluiwHaFP&pid=Api&P=0&h=180",
        "rating": {
          "rate": 4.1,
          "count": 259
        }
      },
      {
        "id": "3",
        "title": "Canon EOS 2000D Spiegelreflexkamera",
        "price": 550.99,
        "description": "ferumfang: Digital Camera EOS 2000D Body black; 18-55mm 3, 5-5, 6 III; Eyecup EF; Camera Cover R-F-3; Neck Strap EW-400D; Battery Charger LC-E10E, Tragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und JugeTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und JugendTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfndliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen FotobedarfBattery Pack LP-E10, Batter.",
        "category": "men's clothing",
        "image": "https://tse2.mm.bing.net/th?id=OIP.eUVlV4V26_d609AKF-D00wHaE_&pid=Api&P=0&h=180",
        "rating": {
          "rate": 4.7,
          "count": 500
        }
      },
      {
        "id": "4",
        "title": "Monitech 48MP Digitalkamera 5K",
        "price": 540.99,
        "description": "ferumfang: Digital Camera EOS 2000D BodyTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und LautsprTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und JugenTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfdliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarf black; 18-55mm 3, 5-5, 6 III; Eyecup EF; Camera Cover R-F-3; Neck Strap EW-400D; Battery Charger LC-E10E, Battery Pack LP-E10, Batter.",
        "category": "men's clothing",
        "image": "https://tse1.mm.bing.net/th?id=OIP.fIeoJZ8DWgpAyZkobPdgogHaHa&pid=Api&P=0&h=180",
        "rating": {
          "rate": 2.1,
          "count": 430
        }
      },
      {
        "id": "5",
        "title": "Digitalkamera Kinder - 48MP Digital",
        "price": 690.99,
        "description": "ferumfang: Digital Camera EOS 2000D Tragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, SelbstauslTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, SelbstauslöseTragbare und Multifunktionale Kamera: Diese tragbare kompaktkamera ist sehr leicht und kann überall in der tasche mitgeführt werden. Sie ist einfach zu bedienen und ideal für Anfänger, Kinder und Jugendliche. Diese vielseitige fotokamera ist mit 20 Filtern, Verwacklungsschutz, Selbstauslöser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarfr, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen Fotobedarföser, Serienbildaufnahme, Datumsstempel, Zeitrafferaufnahme, Smile Capture, internem Mikrofon und Lautsprecher (Aufnahme von Tonvideos) ausgestattet. Perfekt für Ihren täglichen FotobedarfBody black; 18-55mm 3, 5-5, 6 III; Eyecup EF; Camera Cover R-F-3; Neck Strap EW-400D; Battery Charger LC-E10E, Battery Pack LP-E10, Batter",
        "category": "men's clothing",
        "image": "https://tse1.mm.bing.net/th?id=OIP.vH4wlrGChWJhsot_2GLeaQHaIU&pid=Api&P=0&h=180",
        "rating": {
          "rate": 2.1,
          "count": 430
        }
      }
    ]
  }
