/*
اموزش ری اکت سالار حق
درس بیستو سوم و بیست و چهارم/ یوز افکت یا هوک یوز افکت ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

نکته نهایی رو اول بگم  >
اول پروژه ی بخش  فرانت اند رو بادستور مقابل ران کن > npm start
و ای پی ای رو هم با دستور مقابل ران کن > npx json-server --watch ./database(که اینجا اسم فولدرم هست)/db.json --port 8000
ادامه ی ری اکت از فایل زیر
1-salar-app-no-API-Mit-Map

روش دوم >
روش اول در سالار اپ 1 بوود که فایده نداشت .


گرفتن دیتای موردنظر از ای پی ای  
با روش یوز افکت , استیت
>

Lifestyle in React.js:
Initialize - Mounting - Updation - unmounting (دیگه از بین میره)
مراحل اجرای کامپوننت یوز افکت >>**********************************************************************************************************

1. Initialize (مقداردهی اولیه) 
در این مرحله، کامپوننت مقداردهی اولیه می‌شود. این مرحله شامل تنظیم حالت اولیه یا استیت و سایر داده‌هایی است که کامپوننت به آن نیاز دارد.

2.Mounting (نصب کامپوننت)
این مرحله زمانی است که کامپوننت به دام افزوده می‌شود.
render(): برای ساختن UI کامپوننت.

3. Updating (به‌روزرسانی کامپوننت)
کامپوننت زمانی به‌روزرسانی می‌شود که:

پراپز یا استیت تغییر کنند.

متد ست استیت() فراخوانی شود.

4. Unmounting (حذف کامپوننت)
در این مرحله، کامپوننت از دام حذف می‌شود.
 برای پاک‌سازی اشتراک‌ها یا منابع دیگر استفاده می‌شود.


نکات کلی و مهم مصاحبه >**********************************************************************************************************
1>
اسم پراپس را همیشه خودمون دلبخواهی میذاریم و پراپس در حقیقت ورودی کامپوننته 


2>چرا اکسیوس را درون یوز افکت قرار میدیم و چرا حتما باید اکسیوس داخل یوزافکت استفاده بشه >
جواب> 
چونکه یوز افکت  وقتیکه اون براکت اخرو همونطور که دردستور پایین میبینی بذاری کلا یکبار اتفاق میفته 
و وقتی در همین دستور پایین ست ارتیکلز رو میزنی روش که بعبارتی ست استیت میکنی روی اون این ست استیت باعث ریرندر میشه
و وقتی این ست استیت یکبار اتفاق میفته یکبار ریرندر میشه دیگه که ما همون یکبار ریرندر رو میخایم
و درحقیقت داریم میگیم وقتی دیتا اومد ریرندر کن و دیتای جدیدو بما بده
اما >>>>>
اگه ما قسمت اکسیوس رو ازین پایین برداریم و بذاریم بالای یوزافکت خب این میاد بارها و بارها ریرندر میشه
و به اروری بنام زیر میخوری
TOOO many rerender
از خودم > 
رفتم داخل کنسول بخش نت وورک دیدم بطور غیرعادی همه ش تکرار میشه دستور
پس >  
یوزافکت فقط یکبار رندر میشه و تمام و این حسنش هست

useEffect(() => {
        //API call
        axios
            .get('http://localhost:8000/articles')
            .then((result) => {
                //با آسنکرون اویت هم میشه
                setArticles(result.data.data);
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);






3>
چرا از یوز استیت استفاده میکنیم؟
چونکه استیت وقتیکه تغییر میکنه ری رندر اتفاق میفته و جریانو بهمون نشون میده ولی  وقتی متغیر همینجوری استفاده کنیم 
این اتفاق نمیفته و ری اکت متوجه نمیشه.



4>  
  <Navbar title="Shadi Blog" />  داخل فایل Home.jsx   و        <h3> {props.title} </h3>     داخل فایل Navbar.jsx
  بواسطه ی پراپس بهم ارتباط دارند و لینک میشن

در ابتدا توضیح بدم که این دستور تعریف استیت >
const [articles, setArticles] = useState([]);
===>>>>
useState([]) مقدار دهی اولیه رو انجام میدیم درون 
articles و مقدار اولیه قرار میگیره درون 
setArticles و مقدارش رو تغییر میدیم با 




ماونت شدنه دقیقا جاییه که ما میخوایم ای پی ای مون رو بگیریم 
ازخودم > انگار ماونت شدن همون اوله برنامه ی هوم پیجه 

ادامه از سالار حق >
1/ اول ایمپورت فایل یوز افکت از ری اکت دربالای پیج هوم پیج 

2/برو داخل فایل زیر این کارا رو انجام بده >
Page :  Home.jsx

 پاک کردن قسمت تعریف متغیرمون و حذف تمام ایمیج یوار الها از فایل قبلی که سالار اپ 1 بود 

3/ import { useEffect,useState } from 'react';

4/ هوک یوز افکت میاد حالا داخل فانکشن هوم همون بالا اولش میشینه
چیزایی که اولشون کلمه ی یوز هست هوک نامیده میشن در ری اکت

5/حالا هوک یوز رو درست میکنیم که زمان اجرا شدن ماونت میشه برای ساختنش یه اروفانکشن و سپس یه براکت بازوبسته بزار
بجای لت ارتیکلز و یا همون تعریف متغیر باید حتما از استیت استفاده کرد که برای ذخیره ی اطلاعات استفاده میشه
پس لت ارتیکلز حذف میشه 

6/ 
    useEffect(() => {  //hook
        // API call 
    }, []);
    console.log(1);

پس تا اینجا این شد که  باید دیتا یا همون ارایه ای ک ساختیمو قرار بدیم داخل یوز افکت
که اگر با تعریف متغییر معمولی باشه بده و خروجی نداریم چون در حقیقت اپدیت میشه اطلاعاتمون و 
درون ارایه ی زیر پر میشه ولی ری رندر نمیشه و چیزی رو نشونمون نمیده اصلا و در نتیجه چیزی در خروجی نمیبینیم.
الان درخواست و که بزنیم یعنی 
 // API call
ارایه مون که ساخته بودیم هم پر میشه یعنی 
با تعریف استیت که کافیه از دستور زیر استفاده کنیم برای تعریف استیت

7/ تعریف یوز استیت در بالاترین قسمت بلافاصله بعد از شروع فانکشن هوم>
 const [articles, setArticles]= useState([20]);
 ===
const [state, setState]= useState([20]);
که برای مثال مقدار 20 میره میشینه توی اولین ارتیکلز داخل پرانتز 
پس مقدار داخل کروشه میره داخل اسم تعریفی داخل کروشه میشیینه
اسامی دلبخواهن
در حقیقت ری اکت میگه وقتی تو ست استیت کنی یا همون از دومیه استفاده کنی من ری رندرم میشم بعدش
حالا از متد دوم داخل کروشه که همون ست ارتیکلز هست استفاده میکنیم که ری اکت بصورت پیشفرض توی خودش تعریف کرده که من وقتی
که تو ست استیت کنی 
که در حقیقت در قسمت ست ارتیکلز دیتای بک اند رو قرار میدیم که از سمت سرور میاد


پس اتفاقی که میفته اینه>
  اول رندر اجرا میشه که همون اینیشیالایز توی لایف سایکل ری اکت هست و سپس ماونت شدن اجرا میشه که همون دستور بالاییه که نوشتم
یعنی ری اکت اول یکبار رندرش یا اینیشیالایزش اتفاق میفته 
یعنی یو آی و دام رو اول میسازه و سپس میاد ماونتینگ یا هوک یوز افکت اجرا میشه که ری رندرینگ هست
و متوجه میشه که ست استیت توی من اتفاق افتاده و حالا که یوز استیت اتفاق افتاده پس حتماا یه استیتی یه جایی تغییر
کرده حالا که استیت تغییر کرده بیا کامپوننتو دوباره ری رندر کن
برای اینکه اگر چیزی باید تغییر کنه باید درون یوز هوک اتفاق بیفته تا رفرش بشه که انگار ری اکت توی خودش رفرش یا همون یوز افکت
رو انجام میده

چرا از یوز استیت استفاده میکنیم؟
چونکه استیت وقتیکه تغییر میکنه ری رندر اتفاق میفته و جریانو بهمون نشون میده ولی  وقتی متغیر همینجوری استفاده کنیم 
این اتفاق نمیفته و ری اکت متوجه نمیشه.



اموزش ری اکت سالار حق 
قسمت بیست و پنجم > ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

موضوع > 
گرفتن دیتا از ای پی آی و قراردادن در یوز استیت
با ساخت سرور جیسان

1> 
پکیج ارایه دهنده ی ای پی آی فرضی رو به روش زیر میسازیم >
 وارد ساید بار قسمت خالیش شو که خارج از اس ار سی هم هست
 یه نیو فولدر بساز 
database

 داخلش یه فایل به اسم دلخواه بساز که دیتابیس باشهو پسوندش جیسون باشه
 db.json
 
2>حالا وبسایت زیرو که ای پی ای فیک میده باز کن
reqres.in
API : https://reqres.in/api/users?page=2

data: 
.
.
.
.

https://reqres.in/         :  اسم سایته  
که با تعریف اکولاد ساخته میشه تا اینجای بالا


3> وارد فایل دی بی جیسون شو که الان ساختیش بالا و ابجکت جیسانش رو بساز با کی ولیوی زیر
که برای هر ای پی ای باید یه اسم بذاریم درسته ؟؟ و جداگانه یه کی ولیو درست کنیم
{
    "articles":{   // :key
        
    }   // :value
   
}
اولین کی که بنویسیم میشه ای پی آی اولمون



4> نیو ترمینال باز کن 
و بنویس 
 npx json-server --watch database/db.json --port 8000
مینویسم این فایلو بساز و همیشه نگاهش کن اگه تغییری کرد توی پورت هشت هزار اپدیتش کن

5> توی ترمینال اون بغلو باز کن که تمام ترمینالا پیدا باشن


6>
حالا انجام شد 
http://localhost:8000/ شد اسم هاستمون



7>ری اکت دیفالتش روی پورت سه هزار ران میشه
توی ارتیکلز بهمون یه دونه ا ی پی ای داده
به اسم زیر 
http://localhost:8000/articles
که کپی پیست میکنم توی یوار ال مرورگرم ای پی ای من باز میشه روی پورت هشت هزار 


8> الان یه ای پی ای دیگه هم میخام بسازم بنام یوزرر که چون درحالت واچ هست خودش میاره اونم بعدساخت در ترمینال هردورونشون میده 
{
    "articles":{

    },
    "users":{
      
    }
}
    
خروجی ترمینال >
http://localhost:8000/articles
http://localhost:8000/users


نکته > پس تا اینجا فهمیدیم که ابجکتهای سطح بالامون یا تاپ لولمون همون ای پی آی ها هستند
میشه صدتا اصلا ای پی ای درست کرددر این زیر ما دوتا ای پی ای درست میکنیم که اولیش پر هستودومی خالیه
{
    "articles":{
      "status" : "true",
      "message" :"successfully",
      "data":[        
      ]
    },
    "users":{
    }
}
    

10>در بالا براش استاتوس و مسیج هم گذاشتم
و یه دیتاا که اصل کار ما هست .


11>الان برای اجرای هم فرانت اند و هم بک اند همزمان نیاز به دوتا ترمینال داریم >

پروژه فرانت اند رو بادستور مقابل ران کن > npm start
و ای پی ای رو هم با دستور مقابل ران کن > npx json-server --watch ./database(که اینجا اسم فولدرم هست)/db.json --port 8000
و همیشه برای اجرا شدن پروژه ت یادت باشه که باید هردو نود توی ترمینال ران باشن 
یعنی بترتیب   > 
npm start ****************************************************************************************************************************
npx json-server --watch data/db.json --port 8000 ************************************************************************************



12>الان تمام دیتای قبلیمون که یه ارایه درفایل هوم جی اس ایکس بودوکات کرده میارم توی فایل دیبی جیسونم قسمت ست ارتیکلز میندازم
13> ست ارتیکلزو هم حذف میکنم از توی هوم جی اس ایکس که مونده جای دیتام
14> حالا اطلاعاتو سینتکسشو درست میکنم تا خروجی بده 

15>یک ترمینال جدید میسازم و 
 package Axios را اینستال میکنم با دستور داخل پیجش 
بادستور زیر >
npm i axios  

16>نصب که شد و نشست داخل دیپندنسیز فایل پکیج جیسون حالامیریم داخل فایل هوم جی اس ایکس واون بالای صفحه ایمپورتش میکنیم اکسیوسو 
import axios from "axios"; 


17> میریم زیر تعریف استیت و مینویسیم 
 axios.get('http://localhost:8000/articles').then((result) => {//هرچیزی میشه گذاشت اسمشو مثلا ریسپاند یا رز یا رزابت دبخواهیه
console.log(result);
یعنی بیا اکسیوس جان پت کن ازین ای پی ای پورت هشت هزار دیتای ارتیکلتو بگیر  حالا مقادیرو دن کن بزار داخل رزالت
و لاگ بگیر رزالت رو پس کل دستور بصورت زیرمیشه > 

 axios
            .get('http://localhost:8000/articles')    //دیتا رو ازین بگیر
            .then((result) => {      //                 بده به این    
                //هرچیزی میشه گذاشت اسمشو مثلا ریسپاند یا رز یا رزابت دبخواهیه
                console.log(result);
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);


18>حالا میرم داخل پورت سه هزار و رفرش میکنم میبینم که دیتامون میاد 

19>  حالا توی کنسول نگاه میکنم دیتام نشسته اونجا بازش میکنم زیرشاخه شو میرسم به دیتا 
میخام توی هوم جی اس ایکسم برسم به این ارایه ی دیتام توی دیبی جیسونم
پس >
 کل شکل دستور یوز افکت شد زیر >

    const [articles, setArticles] = useState([]);
    useEffect(() => {
        //API call

        axios
            .get('http://localhost:8000/articles')
            .then((result) => {
                //هرچیزی میشه گذاشت اسمشو مثلا ریسپاند یا رز یا رزابت دبخواهیه
                setArticles(result.data.data); //الان دیتایی که توی پورت هشتهزاره ست استیت  میشه و میاد داخل این پرانتزه 
                // و استیتمون اپدیت میشه وسپس در پایین مپ زده میشه روش و همهچی اوکیه
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);

    تا اینجا یاد گرفتمی >
    چطور درخواست بزاریم و چجوری استیت بذاریم 
    و از یوز استیت استفاده کنیم 
    اینکه استیت برای ذخیره سازیه 
    یوز ا فکتت برای جاییه که در واقع ای پی ای کال انجام میشه
    اکسیوس یه پکیجه برای ای پی ای کاله




اموزش ری اکت سالار حق 
قسمت بیست و هفتم >******************************************************************

موضوع > ساخت فوتر
از ابتدا >
1/
فایلو باز کن توی وی اس کد

2/
برای شروع هم فرانت را ران کن و هم سرور جیسون را


3/خب ما فوترو داشتیم داخل پوشه فوتر و توی هوم جی اس ایکس میخایم ازش استفاده کنیم
پس کافیه که ابتدا اون بالای هوم جی اس ایکس ایمپورتش کنیم
کامپوننت فوترو اینجا صداش بزنیم داخل ریترنمون


اموزش ری اکت/ 
سالار حق 
درس بیست و هشتم - ری اکت روتر >
جکار میکنه ؟
یکسری کامپوننتها و روشها هم بهمون میده ک میتونیم صفحه بندی رو برای خودمون داشته باشیم
تاالان روتینگ یا صفحه بندی دست بک اند کار بود
اما الان با فرانت اند کاره و بوسیله ی ری اکت انجام میشه

1/
https://reactrouter.com/en/6.6.1/start/overview 
را سرچ کن 
که میشه داخل ان پی ام هم پیداش کرد بنام >
reactrouter npm سرچش کن


2/برو توی ان پی م و اینساتالو بیار  توی ترمینال و نصبش کن
3/ صفحه زیرو حالا باید از اول بسازیم چون کلاتا الان نداشتیمش >
Über uns

4/
میریم داخل فایل زیر
index.js *******************************************************************
فایل زیرو ایمپورت میکنیم از ری اکت دام
import { BrowserRouter } from "react-router-dom";
 

5/ اون پایینشم تگ زیرو اضافه میکنیم>
  <BrowserRouter>  </BrowserRouter>


6/و اپمون رو کات کرده و  میذاریم وسطش 
که الان هرر اتفاقی توی پروژه ی ما بیفته این تگ بروزر روتر میاد و ذخیره میکنه که توی چه صفحهه ای هستیمو چه صفحه ای جلوتر بودیم و الان برگشتیم
و کلا همه ی اینارو برامون ذخیره میکنه
حالا چرا ؟

اولین چیز اینه که یادمون بمونه صفحات قبلی و بعدی کدوما هستند
پارامترایی که توی صفحه ن چی ان 
یو ار ال رو ما چطوری بگیریم؟
و هزاران اطلاعات دیگه که کار ری اکت روتر دام اینه که این اطلاعاتو برامون نگه میداره
برای این مورد میریم توی فایل ایندکس دات جی اس چون هرچی بخایم میره توی رووت رندر میشه
index.js
و درواقع ما همه چیزمون توی اپ دات جی اس هست که الان همهههه ششش یکجا داخل فایل ایندکس جی اس رندر میشه.
پس برای اینکه بهمه چییییززز دسترسی داشته باشیم میایم داخل فایل ایندکس جی اس و داخل رووت رندر میکنیم . خب برای
اینکار از چی استفاده میکنیم؟



7/حالا از فایل ایندکس جی اس ایکس خارج شده وارد فایل اپ جی اس ایکس شده و میبینیم که برای صفحه بندیمون چکار کنیم 
اوکی حالا ذخیره مونو انجام دادیمو فایل اپ جی اس ایکسمونم تاالان از اول تا حالا بشکل زیربوده که یه هوم هست فقط 
در صورتیکه ما باید یه اباوت آس هم این جا داشته باشیمو نمیتونیم اباوت رو زیر هوم قرار بدیم چون اونم میاد همین جا 
قرار میگیره پس ما باید توی ا ین اپمون صفحه بندی انجام بدیم .چطوری؟
پس داخل صفحه اپ جی اس ایکس شو>


8/
دوتا کامپوننت رو باید از ری اکت روتر دام ایمپورت کنیم >
import { Route , Routes } from "react-router-dom";
که بعدا به ازای هر صفحه ای ک میخوایم روت میسازیم و توی دل روتس میذاریم


9/
الان که وارد اپ جی اس شدیم و فایل دام را ایمپورت کردیم به شکل زیره فایلمون >
import Home from './pages/home/Home';
import { Route , Routes } from "react-router-dom";

function App() {
    return (
        <div>       
   
        </div>
    );
}
export default App;


10/الان هوم را از وسط کات کرده و تگ روتس را میذاریم اون وسط 

11/حالا اولین صفحه ای که باید در دل روتس قرار بدیم ر امیسازیم به چه شکل؟
اول تگ روت را میذاریم که یه تک بسته س و دوتا پراپس میگیره
اولی که پت هست و میگه که در چه مسیری یه چیز ی اتفاق بیفته و مسیرش چی باشه الان میخایم کامپوننت هوم رو بسازیم
که توی صفحه ی اصلی یا همون اسلش باشه که اسلش همون صفحه ی اصلیه


12/ حالا میگه یه چیز دیگه بمن بنام کامپوننت هوم را بده یعنی کامپوننت هوم را برای ما اجرا کن در صفحه ی اصلی
پس دستورش میشه >
App.jsx  :

    <Routes>
                <Route path="/" element={<Home />} />
    </Routes>
            



13/ اولین چیزی که از یه روت جدید برای لینک کردن پیجها به ذهنمون میرسه  اینه که یه کامپوننت جدید درون پیجز براش میسازیم
میریم توی پیجز پس و پوشه اباوت اس رو داریم
ونیو فایل میکنیم رو پوشه ی اباوت اس توی ساید بار
و کامپوننت یا همون پیج جدید رو میسازیم
pages ->> AboutUs ->>  AboutUs.jsx

14/حالا میریم داخل فایل اپ جی اس ایکس به کامپوننت یا همین پیج جدیدمون روت اختصاص میدیم
یه پت داره و المنت >

یعنی ما میخایم  توی مسیر اباوت المنت اباوت اس را اجرا کنه:
function App() {
    return (
        <div>     
       
            <Routes>
                <Route path='/' element={<Home />} />          کامپوننت هوم توی مسیر پیج اصلی اجرا میشه و
                <Route path='/about' element={<AboutUs />} />  کامپوننت اباوت آس توی مسیر اباوت اجرا میشه
                یعنی اگه مسیر اسلش اباوت رو سرچ کنم کامپوننت اباوت اس که داخل تگ المنته رو بما میده کلا توی
                هر مسیری باشم اون کامپوننت داخل تگ المنت رو بما میده
            </Routes>           
        </div>
    );
}
export default App;

پس بطور خلاصه >
کل این ماجرای این درس روتر بشرح زیره >

/*
براوزر روتر که داخل اینکس جی اس ایکسه میاد تاریخچه ی انتقالمون بین صفحات مختلف رو در پروژه مون نگه میداره اینکه 
کدوم صفحه بوده ایم
کدوم صفحه هستیم 
و به کدوم صفحه خواهیم رفت
و سپس برای هر صفحه مون یه روت جداگانه ساخته و داخل اپ دات جی  اس ایکس میذاریم
که در واقع دو تا پراپس میگیره کلا
path : مسیرو مشخص میکنه
element : یا کامپوننت که مشخص میکنه کدوم کامپوننت داخل این مسیر اجرا بشه 
که در این برنامه هوم داخل مسیر اسلش  خالی اجرا میشه و 
اباوت اس داخل مسیر اباوت اجرا میشه
حالاا ممکنه برات سوال باشه که وقتی ما روی منوها کلیک میکنیم 
داخل صفحاتش بشیم که در جلسه ی بعدی میگیم




اموزش ری اکت سالار حق 
قسمت بیستو نهم >

لینک کردن صفحات بهم دیگه 

1/اول میخایم داخل صفحه ی اباوت که میریم نوبارمون رو اونجا هم ببینیم >
پس >

اولین کار اینه که نوبار را از پیج اصلی باید داخل هرکدوم از منوهای زیر هم قرار بدیم که بالینک کردن روی 
هرکدوم وقتی وارد صفحات میشیم نوبارمون اونجا هم باشه البته این بستگی به یوای یا ظاهر برنامه مون داره 
پس داخل صفحه یا همون کامپوننت  هوم جی اس ایکس شده و دستور زیر رو کپی کرده داخل صفحه یا کامپوننت جدید اباوت اس خودمون
<Navbar title="Shadi Blog" />


و نوبار رو هم ایمپورت میکنیم بالای صفحه که بشکل زیر میشه >
AboutUs.jsx :

function AboutUs() {
    return (
        <div>
            <Navbar title="Shadi Blog" />
            <h1>AboutUs</h1>
        </div>
    );
}
export default AboutUs;


2/حالا باید لینکش کنیم پس وارد صفحه یا کامپوننت نوبار شده  که داخلش ال آی هامونو داریم و میخایم لینک کردنو انجام بدیم
کافیه باز هم از ری اکت روتر استفاده کنیم و بیایم توی همین صفحه هم ایمپورتش کنیم این روتر رو پس
بالای صفحه بنویسیم که کامپوننت لینک رو از ری اکت روتر دام ایمپورت کن.

Navbar.jsx :
import { Link } from 'react-router-dom';

3/و از تگ لینک با ال بزرگ استفاده کن بشکل زیر >
       <ul>
            <li>
                 <Link to="/">Liste der Artikel</Link>
            </li>
            <li>
                <Link to="/about"> Über uns</Link>
            </li>
        </ul>
تگ لینک در ری اکت دقیقا مثل تگ ا اچ رف در اچ تی ام ال هستش و عمل میکنه یعنی لینکه.


خب حالا تونستیم دو تا صفحه رو بهم لینک کنیم حتی ده تا صفحه هم داشته باشیم میشه و سرعتش میشه خدای سرعت
البته با ساخت 
Route


حالا ساخت صفحه ی about us:
1/ 
میریم روی ساید بار بغل و یه لینک برای فولدربرای اباوت میسازیم و لینک مودول سی اس اس هم ساخته و سی اس اس را ایمپورت کن 


اموزش ری اکت  سالار حق  *********************************************************************************************************************
درس سی ام / ساخت صفحه مقاله با لینک مربوطه ش

1. برو توی فایل زیر
db.json
و تکه اول که تکه ی اصلی از دیتامون بود و در زیر اوردیم رو پاک کن . الان ارتیکلز ما شد 
کلا دیتامون
{
        "status": "true",
        "message": "successfull",
        "data":
}
حالا اگه بری داخل لوکال هاست هشت هزار میبینی که تکه اول نیست دیگه.
و دیتامون تبدیل به یک ارایه شده



2.
حالا باید حتما بریم به فایل زیر و دیتایی که بالا در دی بی جیسون پاک کردیمو اونجا هم
پاک کنیم درغیراینصورت ارور میده.
Home.jsx
در قسمت اکسیوس که ای پی ای رو میگیری در گت , دستور زیر را به زیرتری تبدیل میکنیم >
setArticles(result.data.data);
setArticles(result.data);
پس چون یه دیتا اونطرف پاک کردیم یک دیتا هم توی هوم جی ا س ایکس پاک میکنیم
پس چون اونطرف یه تغییراتی داشتیم اینطرف هم یه تغییراتی میخایم وگرنه ارور میده.
الان پس ای پی ای ما اماده س 

3.
ی تغییر دیگه م نیازداریم اینکه تاریخ نگارش هم اضافه کنیم به ارتیکلمون
داخل دی بی جیسون هرچی بخایم اضافه میکنیم.


4.
ساخت پیج مقاله >
باید یه پیج مقاله بسازیم و روش که کلیک میکنیم به پیج مقاله لینک بشیم پس یه فولدر میسازیم
articlePage ->>   ArticlePage.jsx 
داخل این صفحه یک فانکشن با دیو و متن اضافه میکنیم و سپس اکسپورتش میکنیم
تااینجا صفحه یا بهتره بگیم کامپوننتشو ساختیم 

5.
حالا باید راوتش را بسازیم
چون برای هر صفحه یه دانه راوت نیاز داریم 
راوتشم که داخل اپ جی اس ایکس میسازیم یادتونه؟
 
App.jsx:

import Article from './pages/articlePage/Article';
.
.
.
<Route path="/article" element={<ArticlePage />} />

پس تا الان ما پیج ارتیکل رو ساختیم و راوت رو هم ساختیم و دیتامون هم اماده س مانده لینک کردنش



اموزش ری اکت سالار حق *****************************************************************************************************
درس سی ویکم / داینامیک روت

1/حالا میخایم روی هررر کدوم از هشت تا مقاله که کلیک کردیم وارد صفحه ی ارتیکلمون بشیم که در 
جلسه ی قبلی ساختیمش 
حالا ارتیکلها کجان ؟ توی صفحه ی هوم جی اس ایکس هستند داخل دستور زیر
<Article key={result.id} article={result} />



2>
پس باید یه لینک بزاریم دور دستور بالا یعنی بشکل زیر >
و ارتیکلو میزاریم وسطش >  

{articles.map((result) => (
                        <Link>
                            <Article key={result.id} article={result} />
                        </Link>
     ))}

  



3>
و اون بالای صفحه هم ایمپورتش کنیم از ری اکت روتر دام
به شکل زیر میشه
import {Link} from 'react-router-dom';


الان میبینیم که شکل صفحه اصلی یعنی هوم بهم ریخته چرا ؟
 چون رابطه ی پدر فرزندیها بهم ریخت با اومدن لینک
پس >
دوتاکارمی مونه که باید انجام داد برای اینکه شکل صفحه درست بشه و از قناسی در بیاد.
اولی اینکه بریم داخل ارتیکلمون دوتا استایل اضافه کنیم یکی به 
articles  
داخل فایل 
home.module.css
که
داخل این دستور زیر هست >

 <div className={styled.articles}>
        {articles.map((result) => (
            <Link>
                <Article key={result.id} article={result} />
            </Link>
        ))}
</div>



4.
میریم داخل فایل 
home.module.css 
اون بالا استایل لینک میدیم>
عرضو از قبلیامیگیریم و میاریم داخل لینکها و میدیم به لینک جدیدا 


home.module.css:

.articles a{
    width: 24%;
}



5.حالا موقع لینک دادنه وقتی کلیک میشه رو مقاله بره صفحه همون مقاله ایکه روش کلیک کردیم>
Home.jsx :
<Link>
     <Article key={result.id} article={result} />
</Link>



6.
خب چگار کنیم ؟
اصلا وقتی قراره دیتای مقاله ای که نمیدونیم چیه رو اینجا قرار بدیم چطوری اخه انجامش بدیم؟
جواب > 
وقتی یه لیست داریم و با کلیک وارد صفحه میشیم اخر روتمون یه اسلش میذاریم و یه دو نقطه میذاریم که بصورت داینامیک روت میشه و کاری میکنیم که با
هر کلیک روی هر مقاله در مسیر یوارال اون ایدی خودمقاله رو نشون بده 
پس یه اسم میداریم روی پتها توی فال اپ جی اس ایکس که بعدا با این ایدی بگیریمش. 
App.jsx:

<Route path="/article/:id" element={<Article />} />
پس برای داینامیک شدن باید مسیر ارتیکل رو که گذاشتیم
اخرش یه اسلش دو نقطه مثل همین دستور بذاریم که باعث میشه این داینامیکه
اتفاق بیفته
و توی صفحه ی هوممون که میخایم حلقه بزنیم روی هرکدوم
ازین ارتیکلها و نمایشش بدیم

7.
حالا چطور بریم اونور کلیک کنیم ککه وقتی کلیک شدایدیه رو نشون بده؟ 
در فایل زیر به اخر ارتیکلمون یه اسلش ایدی هم اضافه میکنیم با اینکار حالا که 
Home.jsx :

<Link to="/article/1">
    <Article key={result.id} article={result} />
</Link>

حالا با هربار کلیک روی ارتیکلها میره به ایدی 1 تا الان



8/حالا چطور ایدی رو داینامیک کنیم؟
همانطور که گفتیم دی بی جیسون هرکدوم از مقاله ها یه ایدی  خاص داره
الان میام توی فایل زیر و بحالت جیسونی تبدیل میکنیم دستور بالا رو یعنی از اکولاد یا بریس بازو بسته و بک تیک استفاده میکنیم.
بک تیک هم خاصیت استرینگی داره و هم جی اسی 
Home.jsx :
 <Link to={`/article/${article.id}`}>
اول روتمون اسلش ارتیکل بود که مینویسیم و سپس ارتیکل ایدی رو میدیم 
الان جی اسی مینویسیم که با دالر و اکولاد بازو بسته 
که از دالر ببعد حالت جی اسی میشه
الان میره به صفحه ی ارتیکل با ایدی داینامیک و هربار که یه حلفه بزنی با مپ ایدی داینامیک که منحصر بفرده میاد 


اموزش ری اکت سالار حق
قسمت سی و دوم >
هوک یوز پارامز

1/ 

یک صفحه مقاله قبلا ساخته بودم به نام 
Article.jsx 
الان میخام تکمیلش کنم یه فایل سی اس اس هم براش بنام زیر درست میکنم >
articlePage.module.css


2/
حالا روی هرکدوم از هشت تا مقاله که کلیک کنم به یک مقاله میرم فقط چون تاا 
الان فقط یوآی رو ساختیم 
ولی الان باید از ای پی ای اطلاعاتو بگیریم
اما تا الان ایدیها متفاوته یعنی روی هرکدوم ازین هشت تا که 
کلیک کنیم میبینیم که اخر یوارال اون تغییر میکنه به 
یوارال تعریفی مون
:
function ArticlePage() {
    const params=useParams();   //console.log(params)   ->>Ausgabe  :  {id: '1'}
    return (
        <div>
پس برای اینکار از فانکشن یوزپارامز استفاده میکنیم 
پارامز همون شماره ی ایدیهایی هست که پاس دادیم به یوار ال .
میگیم یوز پارامز عزیز هر چی پارامز اینجا پاس داده شده که برای مثال ما اینجا پارامز 1 
رو د اریم اینجا بیا بریزش داخل این متغیر پارامز>
خروجیمون یه ابجکته با ایدی 1 

نکته: 
روی هررر کدوم از ارتیکلها بصورت جداگانه کلیک کنیم و لاگ بگیریم یه ایدی جداگانه میده
پس ما بهررر کدام ازین مقاله ها که بریم با استفاده از یوز پارامز که 
مال خود ری اکت روتره میبینیم که پارامتری که باسم ایدی بهش پاس دادیم باسم 
ایدی داره اینو بما نشون میده
App.jsx

 <Route path="/article/:id"         element={<Article />} />   Ausgabe: id 
 و
 اگر اسمشو بزارم پشمک 
 <Route path="/article/:pashmak" element={<Article />} /> Ausgabe: pashmak 
 پس هراسمی بزارم پاس داده میشه مهم نیست چی باشه اسمش دلبخواهیه

 پس این ایدی رو که داخل فایل یا کامپوننت اپ جی اس بهش نام و راوت دادیم میاد 
 داخل کنسول و اینو باسم ایدی از یوزپارامز بمن میدتش و من اینچا توی کامپوننت 
 یا همون فایل ارتیکل توی 
 صفحه م میگیرمش و من توی کدم داخل فایل ارتیکل دستور زیرو بزنم در واقع میاد و ایدی 
 اون پستی که من الان توش هستمو دارم و بااستفاده ازین ایدی الان من میتونم
اینجا داخل فایل 
Article.jsx
ای پی ای کال کنم و اون مقاله ای که میخواستمو بگیرم و بیارم و ازش استفاده بکنم/ 
و دیتاشو نمایش بدم
پس ما توی کدمونم میدونیم توی کدوم صفحه ی کدوم مقاله هستیم.


اموزش ری اکت سالار حق 
قسمت سی و سوم *****************************************************************************
گرفتن دیتای مقاله


1.
میرم روی لوکال هاست هشت هزارو ران میکنم و ادرس ای پی آی مقاله ی اول 
یا همون ایدی مقاله ی اولو 

میگیرم 

API :

http://localhost:8001/articles/1
کپی کرده میبرم داخل فایل یا کامپوننت مقاله م در زیر پیست میکنم
و نگهش میدارم
 تا ازش الان استفاده کنم

Article.jsx :

function ArticlePage() {
    //   http://localhost:8000/articles/1
    const params=useParams();   console.log(params)  // ->>Ausgabe  :  {id: '1'}
    return (
        <div>
            <Navbar title="Shadi Blog" />


2.
 پس تا الان ای پی آی مقاله ی اول رو داریم و 
ایدی موردنظر رو هم که میخایم بفرستیمم داریم 
console.log(params.id);
یعنی از یوز پارامز گرفتیم 
که الان برش میداریم چون نیازش نداریم و در ادامه میریم
ای پی ای کال میکنیم
چجوری ؟
برای ای پی ای کال و اینکه در جا ای پی ای کال بشه 
از یوز افکت استفاده میکنیم
هم مینویسیم تابعش رو و هم اون بالای پیجمون ایمپورتش میکنیم>


خب ما الان ای پی ای را داخل یوز افکت صدا میزنیم و ای پی ای 
رو بما میده >

Article.jsx :

import { useEffect } from 'react';
import axios from 'axios';

function ArticlePage() {
    //   http://localhost:8000/articles/id
    const params = useParams();
    useEffect(() => {
        axios
            .get(`http://localhost:8000/articles/${params.id}`)
            .then((result) => {
                console.log(result.data);
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);

3.
حالا چجوری از دیتای زیر که داخل کد بالاست را در داخل 
قطعه کد پایینترش توی همون پیچ ارتیکل جی اس ایکس ازش استفاده کنیم >؟
Article.jsx:
.
.
console.log(result.data);
.
.

جواب > از یوز استیت استفاده میکنم
اول اون ای پی ای بالا که داخل کامنت گذاشتمو پاک کرده
دستور زیرو مینویسیم با نوشتن دستور زیر خود یوز استیت در بالای صفحه ایمپورت میشه


بسیارررر مهم ******************************************************************************************
سوال مصاحبه >{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}}
چرا دستور ست ارتیکل رو باین صورت زیر مینویسیم ؟
 function ArticlePage() {
    const[article, setArticle]= useState()

    const params = useParams();
    useEffect(() => {
        axios
            .get(`http://localhost:8000/articles/${params.id}`)
            .then((result) => {
                setArticle(result.data);
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);

برای اینکه ریرندر اتفاق بیفته وگرنه ری اکت متوجه نمیشه
خب الان دستورات بالا چکار میکنه؟ 
وقتی دیتای ما از دستور اکسیوس گت ای پی ای در بالا میاد 
میاد توی دن و همه چی اوکی بوده دیتا رو برای ما میریزه داخل این
استیت در زیر و ما حالا میتونیم این استیت رو استفاده کنیم>
const[article

4. حالا برای مثال میایم داخل قسمت جی اس مون که بعد از ریترن میاد و 
برای استفاده از جی اس که از بریس بازو بسته استفاده میشد داخل 
تگ هد مینویسیم >

jsx : 
در قسمت جی اس ایکس خیلی مهمه یادت باشه که اچ تی ام ال 
رو مینویسیم و اول این قسمت رندر میشه و در این زیر تگ اچ یک رو نمیشناسه تایتل 
return (
        <div>
            <Navbar title="Shadi Blog" />
            <div className={styled.articleWrapper}>
                <div className="container">
                    <h1>{article.title}</h1>


نکته بسیاز مهم >
اگر ارور زیرو داد یعنی هنوز دیتا نیومده و رندر اولیه یکبار
اتفاق میفته و این یوز افکته بعدش اتفاق میفته پس بار اول اصلا دیتایی وجودنداره
پس این استیت زیری ماالان کاملا خالیه>
const[article, setArticle]= useState()
و بار اولی که داره رندر اتفاق میفته میگه من اصلا تایتلی ندیدم که بفهمم
از کجا اینو بگیرم ؟؟ پس تو داری یه چیز چرت و پرتی بمن میگی.
پس ما برای اینکه اون رندر اولیه نیاد این گیرو بما بده

Article.jsx:29 Uncaught TypeError: Cannot read properties of undefined (reading 'title')


5. 
پس برای رفع این مشکل یه بریس باز و بسته میزاریم داخل یوز استیت و 
اینجوری دیگه نمیگه هیچی توی من نیست.
و دیگه این ارور بالا رو بما نمیده

نتیجه >*******************************************************************************************
*********************************************************************************************+
کاری که ما کردیم این بود که از یوزپارامز اون ای دی های شماره 
یک تا هشت را که بالای صفحه ی هر ارتیکلمون بود گرفتیم
const params = useParams();

و گذاشتیم  از طریق ای پی آی زیر فرستادیمش به بک اند >
.get(`http://localhost:8000/articles/${params.id}`)

بک اند بوسیله ی ست ارتیکلز زیر بهمون جواب داد 
setArticle(result.data);



و هممممممه ی این کارا رو توی یوز افکت انجام دادیم
useEffect(() => {
        axios
            .get(`http://localhost:8000/articles/${params.id}`)
            .then((result) => {
                setArticle(result.data);
            })
            .catch((error) => {
                console.log(error);
        });
}, []);



و دیتایی که بهمون داد رو توی یوز استیت زیر قرار دادیم که منظور همین ست ارتیکل یعنی 
پارامتر دوم در براکت زیره>
const [article, setArticle] = useState({});



و سپس استیته رو اومدیم و این پایین توی جی اس مون استفاده کردیم .چرا  
 return (
        <div>
            <Navbar title="Shadi Blog" />
            <div className={styled.articleWrapper}>
                <div className="container">
                    <h1>{article.title}</h1>
                    <div className={styled.articleInfo}>
                        <span>Datum:{article.date} </span>
                        <span>Autor:{article.autor} </span>
                        <span>Lesezeit:{article.readingTime} Minuten</span>
                    </div>
                    <img src={article.imageUrl} alt="" />
چرا ؟ چون استیت جای ذخیره سازیه و حالا یوز افکت برای جاییه که وارد یه صفحه ای که میشیم
برای ارسال ای پی ای هستش




Article.jsx: 

import Navbar from '../../components/navbar/Navbar';
import styled from './articlePage.module.css';
import Footer from '../../components/footer/Footer';
import { useParams } from 'react-router-dom';
import { useEffect, useState } from 'react';
import axios from 'axios';


function ArticlePage() {
    const [article, setArticle] = useState({});
    const params = useParams();
    useEffect(() => {
        axios
            .get(`http://localhost:8000/articles/${params.id}`)
            .then((result) => {
                setArticle(result.data);
            })
            .catch((error) => {
                console.log(error);
            });
    }, []);

    return (
        <div>
            <Navbar title="Shadi Blog" />
            <div className={styled.articleWrapper}>
                <div className="container">
                    <h1>{article.title}</h1>
                    <div className={styled.articleInfo}>
                        <span>Datum:{article.date} </span>
                        <span>Autor:{article.autor} </span>
                        <span>Lesezeit:{article.readingTime} Minuten</span>
                    </div>

                    <img src={article.imageUrl} alt="" />
                    <p>{article.content}</p>
                </div>
               
            </div>
            <Footer />
        </div>
         
    );
}

export default ArticlePage;















*/
